app/views/comments/edit.html.erb


          <%= select_tag(:word_id, options_from_collection_for_select(Word.all, :id, :word), :class => "form-control") %>
---
SELECT "words".* FROM "words"

              </label>
              <%= select_tag(:user_id, options_from_collection_for_select(User.all, :id, :username), :class => "form-control") %>
---
SELECT "users".* FROM "users"