app/views/comments/new.html.erb

        </label>
        <%= select_tag(:word_id, options_from_collection_for_select(Word.all, :id, :word), :class => "form-control") %>
---
SELECT "words".* FROM "words"