app/views/users/my_likes.html.erb

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."word_id" = ?  [["word_id", 2]]
---

        <% like.word.comments.each do |comment| %>