app/views/users/show.html.erb

SELECT "words".* FROM "words" WHERE "words"."user_id" = ?  [["user_id", 3]]
---

<% @user.words.each do |word| %>

SELECT "comments".* FROM "comments" WHERE "comments"."word_id" = ?  [["word_id", 8]]
---

        <% word.comments.each do |comment| %>