app/views/words/index.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."word_id" = ? AND "likes"."user_id" = ? AND "likes"."word_id" = ? LIMIT 1  [["word_id", 1], ["user_id", 3], ["word_id", 1]]
---
        <% if  word.fans.exists?(current_user.id) %>
        <% @like = word.likes.find_by(:user_id=>current_user.id, :word_id=>word.id) %>

SELECT "comments".* FROM "comments" WHERE "comments"."word_id" = ?  [["word_id", 1]]
---

      <% word.comments.each do |comment| %>