app/controllers/comments_controller.rb

  def create
    @comment = Comment.new

    @comment.word_id = params[:word_id]
    @comment.body = params[:body]
    @comment.user_id = params[:user_id]

    save_status = @comment.save
---
INSERT INTO "comments" ("word_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["word_id", 1], ["body", "The best"], ["user_id", 3], ["created_at", "2016-12-11 15:35:47.077723"], ["updated_at", "2016-12-11 15:35:47.077723"]]