app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes"
---
  def index
    @likes = Like.all

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @like = Like.find(params[:id])

INSERT INTO "likes" ("user_id", "word_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["word_id", 1], ["created_at", "2016-12-11 10:25:17.162504"], ["updated_at", "2016-12-11 10:25:17.162504"]]
---
  def create
    @like = Like.new

    @like.user_id = params[:user_id]
    @like.word_id = params[:word_id]

    save_status = @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    @like = Like.find(params[:id])

    @like.destroy