app/controllers/words_controller.rb

  def index
    @words = Word.all
---
SELECT "words".* FROM "words"

  def show
    @word = Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @word = Word.new

    @word.word = params[:word]
    @word.author = params[:author]
    @word.user_id = params[:user_id]

    save_status = @word.save
---
INSERT INTO "words" ("word", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @word = Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", 9]]

  def update
    @word = Word.find(params[:id])

    @word.word = params[:word]
    @word.author = params[:author]
    @word.user_id = params[:user_id]

    save_status = @word.save
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "words" SET "author" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["author", "Fyodor Dostoyevsky"], ["updated_at", "2016-12-11 14:55:12.157287"], ["id", 10]]

  def destroy
    @word = Word.find(params[:id])

    @word.destroy
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", 9]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 9]]